{
    "Social_Media_Site": "Reddit",
    "Post_Topic": "Everything is priced in.",
    "Post_Content": "Don't even ask the question. The answer is yes, it's priced in. Think Amazon will beat the next earnings? That's already been priced in. You work at the drive thru for Mickey D's and found out that the burgers are made of human meat? Priced in. You think insiders don't already know that? The market is an all powerful, all encompassing being that knows the very inner workings of your subconscious before you were even born. Your very existence was priced in decades ago when the market was valuing Standard Oil's expected future earnings based on population growth that would lead to your birth, what age you would get a car, how many times you would drive your car every week, how many times you take the bus/train, etc. Anything you can think of has already been priced in, even the things you aren't thinking of. You have no original thoughts. Your consciousness is just an illusion, a product of the omniscent market. Free will is a myth. The market sees all, knows all and will be there from the beginning of time until the end of the universe (the market has already priced in the heat death of the universe). So please, before you make a post on wsb asking whether AAPL has priced in earpods 11 sales or whatever, know that it has already been priced in and don't ask such a dumb fucking question again.",
    "Post_Hashtags": "#Pondering",
    "Post_Date": "2019-12-16T06:52:12",
    "Post_Likes_Pre_Comment": 10892,
    "Post_Reply_Num_Pre_Comment": 448,
    "Comments": [
        {
            "Comment": "I see this post. I see the Comment field - it asks me what my thoughts are.  \n\n\nBut my thoughts are already priced in.",
            "Comment_Date": "2019-12-16T06:58:22",
            "Comment_Likes": 1688,
            "Comment_Replies": 16,
            "Replies": [
                {
                    "Reply": "We should legit just lock the thread at this point because every possible comment or reflection on OP's post is already priced in.",
                    "Reply_Date": "2019-12-16T07:47:14",
                    "Reply_Likes": 402
                },
                {
                    "Reply": "In fact your comment has already been made by the market. Priced in.",
                    "Reply_Date": "2019-12-16T09:10:32",
                    "Reply_Likes": 3
                },
                {
                    "Reply": "🎵 *What did you dream?*\n\n*It’s alright, we told ya what to dream!* 🎵",
                    "Reply_Date": "2019-12-16T11:49:22",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "https://www.reddit.com/r/wallstreetbets/comments/d5mm02/so_much_respect_for_uhaupt91_after_doing_this_but/\n\nAn informative meme on the topic of being priced in",
                    "Reply_Date": "2019-12-16T12:06:17",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "I was going to say the same thing, so I just scrolled down until I found my priced in thought.",
                    "Reply_Date": "2019-12-16T12:35:01",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "If my comment would’ve been any good, someone would have made it by now. No point in trying.",
                    "Reply_Date": "2019-12-16T16:00:10",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "You commenting this meta-post was already priced in.",
                    "Reply_Date": "2020-03-18T04:41:22",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "Whether or not we perceive a choice to comment is irrelevant. The price knows what we will do, and we have already been priced in. What we must do is understand the price. No one can see beyond a price point they do not understand.",
                    "Reply_Date": "2019-12-16T07:59:44",
                    "Reply_Likes": 67
                },
                {
                    "Reply": "R9K mode?",
                    "Reply_Date": "2019-12-16T08:42:59",
                    "Reply_Likes": 14
                },
                {
                    "Reply": "We can't just lock the thread yet, it's been priced in, changing the apparent 'natural evolution' of this thread is part of the priced in price that is being priced in, this is the illusion \"we should, or we could\" NO, it's all already been priced in, sit back and enjoy!",
                    "Reply_Date": "2019-12-16T08:07:18",
                    "Reply_Likes": 12
                },
                {
                    "Reply": "It's been 7 days since I thought about the game.",
                    "Reply_Date": "2019-12-16T09:58:43",
                    "Reply_Likes": 3
                },
                {
                    "Reply": "But wait a second, if everything’s priced in why ISNT the lock there already? Could it be that either NOT everything is always priced in as OP says, or that often the pricing in isn’t done correctly and so there are still market opportunities despite people thinking everything is priced in?? My head hurts",
                    "Reply_Date": "2021-11-27T11:25:00",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "Is this a line from the matrix? It kinda reminds me of that scene when they were talking with the french man but its been a while so I'm not sure.",
                    "Reply_Date": "2019-12-17T00:16:47",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "There's no such thing as the natural evolution of the thread, prematurely locking it is already priced in.",
                    "Reply_Date": "2019-12-16T22:23:23",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "You just lost the game. So did i",
                    "Reply_Date": "2021-11-27T11:25:38",
                    "Reply_Likes": 1
                },
                {
                    "Reply": "Sort of yeah I had just watched it the night before",
                    "Reply_Date": "2019-12-17T08:32:18",
                    "Reply_Likes": 1
                }
            ]
        }
    ]
}